Modules/CountryManagement/Http/Controllers/Web/Admin/CountryManagementController.php

select * from `language_master`
select * from `countries` order by `group_id` desc limit 1
---
            ->latest()->paginate(pagination_limit())->appends($query_param);
//        dd($country);

        $languages = DB::table('language_master')->get();
        $country_data = Country::orderBy('group_id', 'desc')->first();