Modules/AdminModule/Http/Controllers/Web/Admin/AdminController.php

select * from `accounts` where (`user_id` = '4ec9f499-180c-4e81-9ba1-e79ebf36db8b') limit 1
select sum(`received_balance`) as aggregate from `accounts`
select count(*) as aggregate from `users` where (`user_type` = 'customer') and `users`.`deleted_at` is null
select count(*) as aggregate from `providers` where (`is_approved` = 1)
select count(*) as aggregate from `services`
---
    public function dashboard(Request $request, Transaction $transaction): Application|Factory|View
    {
        $data = [];
        $account_data = $this->account->where(['user_id' => auth()->id()])->first();
        $data[] = ['top_cards' => [
            'total_commission_earning' => $account_data['received_balance'] ?? 0,
            'total_system_earning' => $this->account->sum('received_balance') + $this->account->sum('total_withdrawn'),
            'total_customer' => $this->user->where(['user_type' => 'customer'])->count(),
            'total_provider' => $this->provider->where(['is_approved' => 1])->count(),
            'total_services' => $this->service->count()

select * from `bookings` where `bookings`.`id` in ('d8253ae7-db0a-4496-9967-069d616dd10c')
select * from `transactions` where month(`created_at`) = '10' order by `created_at` desc limit 5
select count(*) as aggregate from `transactions`
select `id`, `name`, `thumbnail` from `services` where `services`.`id` in ('1306802f-9ac2-481d-bf0d-7266f13bf2be', '388cf47b-44f9-432f-80a3-60b7f18b0145')
select * from `reviews` where `reviews`.`provider_id` in ('2434cec3-dcd7-42cd-aa8b-00f0300d4f54', '2cf04366-9065-4ec4-9273-6819131c05e6', '34592202-62f3-4b25-a814-1413742b1b5a', '46aa2521-717c-440e-b4f9-2beb6b498ca9', '62434d81-fe80-40a6-a7ed-73931161fcb7')
select count(*) as aggregate from `bookings`
---
        $data[] = ['earning_stats' => $all_earnings, 'commission_stats' => $all_commissions];

        //recent transactions
        $recent_transactions = $this->transaction
            ->with(['booking'])
            ->whereMonth('created_at', now()->month)
            ->latest()
            ->take(5)
            ->get();
        $data[] = [
            'recent_transactions' => $recent_transactions,
            'this_month_trx_count' => $transaction->count()
        ];

        //recent bookings
        $bookings = $this->booking->with(['detail.service' => function ($query) {
                $query->select('id', 'name', 'thumbnail');
            }])
            ->where('booking_status', 'pending')
            ->take(5)->latest()->get();
        $data[] = ['bookings' => $bookings];

        //top providers
        $top_providers = $this->provider
            ->withCount(['reviews'])
            ->with(['owner', 'reviews'])
            ->ofApproval(1)
            ->take(5)->orderBy('avg_rating', 'DESC')->get();
        $data[] = ['top_providers' => $top_providers];

        //zone wise booking data
        $zone_wise_bookings = $this->booking
            ->with('zone')
            ->whereHas('zone', function ($query) {
                $query->ofStatus(1);
            })
            ->whereMonth('created_at', now()->month)
            ->select('zone_id', DB::raw('count(*) as total'))
            ->groupBy('zone_id')
            ->get();

select count(*) as aggregate from `channel_lists` where exists (select * from `channel_users` where `channel_lists`.`id` = `channel_users`.`channel_id` and `user_id` = '4ec9f499-180c-4e81-9ba1-e79ebf36db8b' and `is_read` = 0 and `channel_users`.`deleted_at` is null) and `channel_lists`.`deleted_at` is null
---
    public function get_updated_data(Request $request): JsonResponse
    {
        $message = $this->channelList->wherehas('channelUsers', function ($query) use ($request) {
            $query->where('user_id', $request->user()->id)->where('is_read', 0);
        })->count();