Modules/CustomerModule/Http/Controllers/Web/Admin/CustomerController.php

    public function index(Request $request): View|Factory|Application
    {
        $search = $request->has('search') ? $request['search'] : '';
        $status = $request->has('status') ? $request['status'] : 'all';
        $query_param = ['search' => $search, 'status' => $status];

        $customers = $this->user->withCount(['bookings'])->whereIn('user_type', CUSTOMER_USER_TYPES)
            ->when($request->has('search'), function ($query) use ($request) {
                $keys = explode(' ', $request['search']);
                return $query->where(function ($query) use ($keys) {
                    foreach ($keys as $key) {
                        $query->orWhere('first_name', 'LIKE', '%' . $key . '%')
                            ->orWhere('last_name', 'LIKE', '%' . $key . '%')
                            ->orWhere('phone', 'LIKE', '%' . $key . '%')
                            ->orWhere('email', 'LIKE', '%' . $key . '%');
                    }
                });
            })
            ->when($status != 'all', function ($query) use ($request) {
                return $query->ofStatus(($request['status'] == 'active') ? 1 : 0);
            })->latest()->paginate(pagination_limit())->appends($query_param);
---
select `users`.*, (select count(*) from `bookings` where `users`.`id` = `bookings`.`customer_id`) as `bookings_count` from `users` where `user_type` in ('customer') and (`first_name` LIKE '%peafowltesting%' or `last_name` LIKE '%peafowltesting%' or `phone` LIKE '%peafowltesting%' or `email` LIKE '%peafowltesting%') and `users`.`deleted_at` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `users` where `user_type` in ('customer') and (`first_name` LIKE '%peafowltesting%' or `last_name` LIKE '%peafowltesting%' or `phone` LIKE '%peafowltesting%' or `email` LIKE '%peafowltesting%') and `users`.`deleted_at` is null