Modules/BusinessSettingsModule/Lib/Business.php

    function business_config($key, $settings_type)
    {
        try {
            $config = BusinessSettings::where('key_name', $key)->where('settings_type', $settings_type)->first();
---
select * from `business_settings` where `key_name` = 'currency_symbol_position' and `settings_type` = 'business_information' limit 1

    function pagination_limit()
    {
        try {
            if (!session()->has('pagination_limit')) {
                $limit = BusinessSettings::where('key_name', 'pagination_limit')->where('settings_type', 'business_information')->first()->live_values;
---
select * from `business_settings` where `key_name` = 'pagination_limit' and `settings_type` = 'business_information' limit 1