Modules/Auth/Http/Controllers/Api/V1/LoginController.php

    public function customer_login(Request $request): JsonResponse
    {
        $validator = Validator::make(
            $request->all(),
            $this->validation_array
        );
        if ($validator->fails()) return response()->json(response_formatter(AUTH_LOGIN_403, null, error_processor($validator)), 403);

        $user = $this->user->where(['phone' => $request['email_or_phone']])
            ->orWhere('email', $request['email_or_phone'])
            ->orWhere('mobile', $request['email_or_phone'])
            ->ofType(CUSTOMER_USER_TYPES)
            ->first();
---
select * from `users` where ((`phone` = 'peafowltesting@gmail.com') or `email` = 'peafowltesting@gmail.com' or `mobile` = 'peafowltesting@gmail.com') and `user_type` in ('customer') and `users`.`deleted_at` is null limit 1