Modules/CategoryManagement/Http/Controllers/Web/Admin/MainCategoryController.php

select * from `zones` where `is_active` = 1
select * from `language_master`
select * from `maincategories` order by `group_id` desc limit 1
---
    public function create(Request $request):View|Factory|Application
    {

        $search = $request->has('search') ? $request['search'] : '';
        $status = $request->has('status') ? $request['status'] : 'all';
        $query_param = ['search' => $search, 'status' => $status];

        $maincategories = $this->main_category
            ->selectRaw("group_id,GROUP_CONCAT(image order By lang_id) as image,is_active,GROUP_CONCAT(name order By lang_id) as name,GROUP_CONCAT(service_id order By lang_id) as service_id,GROUP_CONCAT(product_id order By lang_id) as product_id,GROUP_CONCAT(id) as id,GROUP_CONCAT(lang_id) as lang_id,color")
            ->when($request->has('search'), function ($query) use ($request) {
                $keys = explode(' ', $request['search']);
                foreach ($keys as $key) {
                    $query->orHavingRaw('name LIKE ?', array("%$key%"));
                }
            })
            //->join('categories', 'categories.id', '=', 'maincategories.service_id')
            ->groupBy('group_id', 'is_active')
            ->when($status != 'all', function ($query) use ($status) {
                $query->ofStatus($status == 'active' ? 1 : 0);
            })->paginate(pagination_limit())->appends($query_param);

        $service_categories = $this->service_category->ofType('main')->where('lang_id', 1)->orderBy('name')->get(['id', 'name']);
        $service_categories_arabic = $this->service_category->ofType('main')->where('lang_id', 2)->orderBy('name')->get(['id', 'name']);

        $product_categories = $this->product_category->ofType('main')->where('lang_id', 1)->orderBy('name')->get(['id', 'name']);
        $product_categories_arabic = $this->product_category->ofType('main')->where('lang_id', 2)->orderBy('name')->get(['id', 'name']);

        $zones = $this->zone->where('is_active', 1)->get();

        $languages = DB::table('language_master')->get();

        $main_category_data = Maincategories::orderBy('group_id', 'desc')->first();