app/Http/Controllers/LandingController.php

select * from `business_settings` where `settings_type` not in ('payment_config', 'third_party')
---
    public function home()
    {
        $settings = $this->businessSettings->whereNotIn('settings_type', ['payment_config', 'third_party'])->get();