Modules/Auth/Http/Controllers/LoginController.php

    public function admin_login(Request $request): RedirectResponse
    {
        $request->validate($this->validation_array);

        $user = $this->user->where(['phone' => $request['email_or_phone']])
            ->orWhere('email', $request['email_or_phone'])
            ->ofType(ADMIN_USER_TYPES)->first();

        if (isset($user) && Hash::check($request['password'], $user['password'])) {
            if ($user->is_active && $user->roles->count() > 0 && $user->roles[0]->is_active || $user->user_type == 'super-admin') {
---
select * from `users` where ((`phone` = 'admin@repair.com') or `email` = 'admin@repair.com') and `user_type` in ('super-admin', 'admin-employee') and `users`.`deleted_at` is null limit 1
select `roles`.*, `user_roles`.`user_id` as `pivot_user_id`, `user_roles`.`role_id` as `pivot_role_id` from `roles` inner join `user_roles` on `roles`.`id` = `user_roles`.`role_id` where `user_roles`.`user_id` = '4ec9f499-180c-4e81-9ba1-e79ebf36db8b'